{
  "A": {
    "name": "Vitamin A",
    "uses": "Vitamin A is also known as Retinol. It is good for vision and helps in improving immune system, and maintains skin and cellular health. ",
    "sources": "Major sources of vitamin A are sweet potato, pumpkin, milk, carrot and green vegetables like spinach and broccoli. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-A_280x280.png"
  },
  "B": {
    "name": "Vitamin B",
    "uses": "Vitamin B plays an important role in our overall body health and energy levels. ",
    "sources": "B vitamins are found in highest abundance in meat. Other sources include pulses, beans, potatoes and bananas. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B_280x280.png"
  },
  "B 1": {
    "name": "Vitamin B1",
    "uses": "Vitamin B1 is also known as thiamine. It plays a major role in metabolizing food into energy. ",
    "sources": "Vitamin B1 is found in whole-grain cereals, beans, nuts, yeast, and meats. Too little vitamin B1 causes beriberi, a disease affecting the heart, digestive system, and the nervous system . ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B1_280x280.png"
  },
  "B 2": {
    "name": "Vitamin B2",
    "uses": "Vitamin B2 is also known as riboflavin. This vitamin boosts immune system and maintains the health of our skin, the lining of our gut, and blood cells. ",
    "sources": "Major sources are Fish, meat, and poultry, such as turkey, chicken and eggs. Other sources include Nuts, Dairy products, and Asparagus. ",
    "diseases": "Too little vitamin B1 causes Cracked lips, Dry skin, and Mouth ulcers.",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B2_280x280.png"
  },
  "B 3": {
    "name": "Vitamin B3",
    "uses": "Vitamin B3 is also knows as niacin. Vitamin B3 is responsible for breaking down food into energy. ",
    "sources": "Major sources are Legumes, nuts, dairy, fish, and lean meats. Other sources include cooked potatoes, soya milk, and black eyed peas. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B3_280x280.png"
  },
  "B 5": {
    "name": "Vitamin B5",
    "uses": "Vitamin B5 is necessary for our bodies to produce hormones, and is also needed for growth. ",
    "sources": "Vitamin B5 can be found in vegetables of the cabbage family, such as broccoli, kale, and avocado. Other sources include whole-grain cereals, potatoes, dairy, and organ meats. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B5_280x280.png"
  },
  "B 6": {
    "name": "Vitamin B6",
    "uses": "Vitamin B6 helps build new red blood cells, and reduces the risk of heart diseases. ",
    "sources": "Major sources of Vitamin B6 are Bananas, Beans, Lentils, Milk, and Brown rice. Carrots and Chicken also contains Vitamin B6. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B6_280x280.png"
  },
  "B 7": {
    "name": "Vitamin B7",
    "uses": "Vitamin B7 is also known as Biotin. It is needed by body to metabolize fats, carbohydrates, and protein. Vitamin B7 improves the durability of fingernails, and enhances hair and skin health. ",
    "sources": "Major sources of Vitamin B7 are walnuts, peanuts, cereals, milk, and egg yolks. In general, a healthy varied diet provides the body with sufficient amounts of biotin. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B7_280x280.png"
  },
  "B 9": {
    "name": "Vitamin B9",
    "uses": "Vitamin B9 is also known as folic acid. It is necessary for the body's growth and development. Pregnant women should take good amount of this vitamin as it is vital to a baby's health and development. ",
    "sources": "Major sources are dark-green leafy vegetables, asparagus, and brussels sprouts. Nuts, beans, and peas also contain Vitamin B9. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B9_280x280.png"
  },
  "B 12": {
    "name": "Vitamin B12",
    "uses": "Vitamin B12 is essential for building blood cells and maintaining healthy nerve cells in the body. ",
    "sources": "Natural sources rich in vitamin B12 are dairy products, fish, meat. Other sources include breakfast cereals and nutritional yeast. The B12 vitamin is not abundantly available from plant products, making B12 deficiency a legitimate concern for vegetarians. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-B12_280x280.png"
  },
  "C": {
    "name": "Vitamin C",
    "uses": "The body uses vitamin C to make skin, tendons, ligaments and blood vessels. It also uses this vitamin to maintain bones, teeth, and to heal wounds. ",
    "sources": "Major sources are citrus fruits, kiwis, mangos, papayas, pineapples and watermelon. Berries such as, strawberries, raspberries, blueberries, and cranberries are also rich in vitamin C. ",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-C_280x280.png"
  },
  "D": {
    "name": "Vitamin D",
    "uses": "Vitamin D is also known as the sunlight vitamin. It helps the body absorb calcium, which creates healthy bones and teeth. ",
    "sources": "Major Sources of vitamin D are Sunlight, Fish liver oils, Fortified cereals, milk and dairy products like, cheese, yogurt, butter, and cream. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-D_280x280.png"
  },
  "E": {
    "name": "Vitamin E",
    "uses": "Vitamin E plays an important role in regulating body processes, such as blood pressure and muscle contraction. ",
    "sources": "Vitamin E is majorly found in nuts and seeds. Other sources include dark green leafy vegetables, corn, and Oils like corn, and sunflower oil. ",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-E_280x280.png"
  },
  "K": {
    "name": "Vitamin K",
    "uses": "Vitamin K is known as the blood clotting vitamin for its important role in healing wounds, and bone health. ",
    "sources": "Bacteria in our gut naturally make vitamin K. It can also be found in vegetables like cauliflower and cabbage.",
    "diseases": "",
    "imageURL": "https://s3.amazonaws.com/vitamin-guide/vitamin-K_280x280.png"
  }
}